Revit 2026 API

# IExportContextOnLinkBegin Method

---

This method marks the beginning of a link instance to be exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
RenderNodeAction OnLinkBegin(
	LinkNode node
)
```
```vb
Function OnLinkBegin (
	node As LinkNode
) As RenderNodeAction
```
```cpp
RenderNodeAction OnLinkBegin(
	LinkNode^ node
)
```
```fsharp
abstract OnLinkBegin :
        node : LinkNode -> RenderNodeAction
```

#### Parameters

node LinkNode

#### Return Value

RenderNodeAction Return RenderNodeAction.Skip if you wish to skip processing this link instance, or return RenderNodeAction.Proceed otherwise.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace